gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/Libraries/NBIot/nbiotfunc.c
#if NBIOT_COMMAND_TIMEOUT_TYPE
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, NBIOT_COMMAND_NBAND_MSEC);
#else
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
#endif
	
	memset((void *)pClient->DataProcessStack, 0x0, pClient->DataProcessStack_size);
	sprintf((char *)pClient->DataProcessStack, "AT+NBAND=%d", bands.NBandVal[0]);
	for (int index = 1; index < bands.NBandNum; index++) {
		datalength = strlen((const char*)pClient->DataProcessStack);
		sprintf((char *)(pClient->DataProcessStack + datalength), ",%d", bands.NBandVal[index]);
	}
	datalength = strlen((const char*)pClient->DataProcessStack);
	sprintf((char *)(pClient->DataProcessStack + datalength), "%c", '\r');
	
	NBIOT_Neul_NBxx_ATCmd_SetCmdStack(pClient, pClient->DataProcessStack, strlen((char *)pClient->DataProcessStack), "OK", "ERROR");
	
#if NBIOT_PRINT_ERROR_CODE_TYPE
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_ERROR) {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#else
	NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack);
#endif
	
	return NBStatus;
}
#endif

#if NBIOT_ATCMD_GET_NBAND
/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadSupportedBands(NBIOT_ClientsTypeDef* pClient)
 @Description			NBIOT_Neul_NBxx_CheckReadSupportedBands		: 查询Band
 @Input				pClient								: NBIOT客户端实例
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadSupportedBands(NBIOT_ClientsTypeDef* pClient)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	int bands[3] = {0};
	int bandnum = 0;
	
#if NBIOT_COMMAND_TIMEOUT_TYPE
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, NBIOT_COMMAND_NBAND_MSEC);
#else
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
#endif
	
	NBIOT_Neul_NBxx_ATCmd_SetCmdStack(pClient, (unsigned char*)"AT+NBAND?\r", strlen("AT+NBAND?\r"), "OK", "ERROR");
	
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
		if (sscanf((const char*)pClient->ATCmdStack->ATRecvbuf, "%*[^NBAND]%*[^:]:%d,%d,%d", &bands[0], &bands[1], &bands[2]) <= 0) {
			NBStatus = NBIOT_ERROR;
		}
		else {
			for (int index = 0; index < NBIOT_NBAND_NUM; index++) {
				pClient->Parameter.band.NBandVal[index] = (NBIOT_BandTypeDef)0;
				if ((bands[index] == NBand_2100MHz) || (bands[index] == NBand_1800MHz) || (bands[index] == NBand_850MHz) || \
				    (bands[index] == NBand_900MHz)  || (bands[index] == NBand_800MHz)  || (bands[index] == NBand_700MHz)) {
					pClient->Parameter.band.NBandVal[bandnum] = (NBIOT_BandTypeDef)bands[index];
					bandnum++;
				}
			}
			pClient->Parameter.band.NBandNum = bandnum;
		}
	}
#if NBIOT_PRINT_ERROR_CODE_TYPE
	else {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#endif
	
	return NBStatus;
}
#endif

#define NBTEST_BAND_MAX					20

static bool isSubset(int mainarr[], int subarr[], int mainlen, int sublen)
{
	int i = 0, j = 0;
	
	for (i = 0; i < sublen; i++) {
		for (j = 0; j < mainlen; j++)
			if (subarr[i] == mainarr[j]) break;
		if (j == mainlen) return false;
	}
	
	return true;
}

#if NBIOT_ATCMD_TST_NBAND
/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_TestSupportedBands(NBIOT_ClientsTypeDef* pClient, NBIOT_NBandTypeDef bands)
 @Description			NBIOT_Neul_NBxx_TestSupportedBands			: 测试Band是否支持
 @Input				pClient								: NBIOT客户端实例
					bands								: 需配置bands
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_TestSupportedBands(NBIOT_ClientsTypeDef* pClient, NBIOT_NBandTypeDef bands)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	
#if NBIOT_COMMAND_TIMEOUT_TYPE
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, NBIOT_COMMAND_NBAND_MSEC);
#else
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
#endif
	
	NBIOT_Neul_NBxx_ATCmd_SetCmdStack(pClient, (unsigned char*)"AT+NBAND=?\r", strlen("AT+NBAND=?\r"), "OK", "ERROR");
	
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
		char* pRecv = (char*)pClient->ATCmdStack->ATRecvbuf;
		int v, n;
		int SupportBands[NBTEST_BAND_MAX] = {0};
		int SupportBandNum = 0;
		int UserBands[NBTEST_BAND_MAX] = {0};
		int UserBandNum = 0;
		if (sscanf(pRecv, "%*[^NBAND]%*[^:]:(%d,%n", &v, &n) == 1) {
			SupportBands[0] = v;
			SupportBandNum++;
			pRecv += n;
			for (int i = 1; i < NBTEST_BAND_MAX; i++) {
				if (sscanf(pRecv, "%d,%n", &v, &n) == 1) {
					SupportBands[i] = v;
					SupportBandNum++;
					pRecv += n;
				}
				else {
					break;
				}
			}
			for (int i = 0; i < bands.NBandNum; i++) {
				UserBands[i] = bands.NBandVal[i];
			}
			UserBandNum = bands.NBandNum;
			if (isSubset(SupportBands, UserBands, SupportBandNum, UserBandNum) != true) {
				NBStatus = operation_not_supported;
				pClient->Parameter.bandsupport = false;
				goto exit;
			}
			else {
				pClient->Parameter.bandsupport = true;
			}
		}
		else {
			NBStatus = NBIOT_ERROR;
			goto exit;
		}
	}
#if NBIOT_PRINT_ERROR_CODE_TYPE
	else {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#endif
	
exit:
	return NBStatus;
}
#endif

#if NBIOT_ATCMD_SET_CMEE
/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetReportTerminationError(NBIOT_ClientsTypeDef* pClient, NBIOT_ReportErrorTypeDef enable)
 @Description			NBIOT_Neul_NBxx_SetReportTerminationError	: 设置CMEE
 @Input				pClient								: NBIOT客户端实例
					enable								: CMEDisable						= 0
														  CMEEnable						= 1
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetReportTerminationError(NBIOT_ClientsTypeDef* pClient, NBIOT_ReportErrorTypeDef enable)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	
