gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/Libraries/NBIot/nbiotfunc.c
#if NBIOT_COMMAND_TIMEOUT_TYPE
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, NBIOT_COMMAND_CMEE_MSEC);
#else
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
#endif
	
	memset((void *)pClient->DataProcessStack, 0x0, pClient->DataProcessStack_size);
	sprintf((char *)pClient->DataProcessStack, "AT+CMEE=%d\r", enable);
	
	NBIOT_Neul_NBxx_ATCmd_SetCmdStack(pClient, pClient->DataProcessStack, strlen((char *)pClient->DataProcessStack), "OK", "ERROR");
	
	NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack);
	
	return NBStatus;
}
#endif

#if NBIOT_ATCMD_GET_CMEE
/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadReportTerminationError(NBIOT_ClientsTypeDef* pClient)
 @Description			NBIOT_Neul_NBxx_CheckReadReportTerminationError	: 查询CMEE
 @Input				pClient									: NBIOT客户端实例
 @Return				NBIOT_StatusTypeDef							: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadReportTerminationError(NBIOT_ClientsTypeDef* pClient)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	int cmeeval = 0;
	
#if NBIOT_COMMAND_TIMEOUT_TYPE
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, NBIOT_COMMAND_CMEE_MSEC);
#else
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
#endif
	
	NBIOT_Neul_NBxx_ATCmd_SetCmdStack(pClient, (unsigned char*)"AT+CMEE?\r", strlen("AT+CMEE?\r"), "OK", "ERROR");
	
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
		if (sscanf((const char*)pClient->ATCmdStack->ATRecvbuf, "%*[^CMEE]%*[^:]:%d", &cmeeval) <= 0) {
			NBStatus = NBIOT_ERROR;
		}
		else {
			if ((cmeeval == CMEDisable) || (cmeeval == CMEEnable)) {
				pClient->Parameter.cmeestate = (NBIOT_ReportErrorTypeDef)cmeeval;
			}
			else {
				NBStatus = NBIOT_ERROR;
			}
		}
	}
	
	return NBStatus;
}
#endif

#if NBIOT_ATCMD_SET_NCDP
/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetCDPServer(NBIOT_ClientsTypeDef* pClient, const char *host, unsigned short port)
 @Description			NBIOT_Neul_NBxx_SetCDPServer				: 设置CDP服务器
 @Input				pClient								: NBIOT客户端实例
					host									: CDP Server Address
					port									: CDP Server Port
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetCDPServer(NBIOT_ClientsTypeDef* pClient, const char *host, unsigned short port)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	
#if NBIOT_COMMAND_TIMEOUT_TYPE
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, NBIOT_COMMAND_NCDP_MSEC);
#else
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
#endif
	
	memset((void *)pClient->DataProcessStack, 0x0, pClient->DataProcessStack_size);
	sprintf((char *)pClient->DataProcessStack, "AT+NCDP=%s,%d\r", host, port);
	
	NBIOT_Neul_NBxx_ATCmd_SetCmdStack(pClient, pClient->DataProcessStack, strlen((char *)pClient->DataProcessStack), "OK", "ERROR");
	
#if NBIOT_PRINT_ERROR_CODE_TYPE
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_ERROR) {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#else
	NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack);
#endif
	
	return NBStatus;
}
#endif

#if NBIOT_ATCMD_GET_NCDP
/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadCDPServer(NBIOT_ClientsTypeDef* pClient)
 @Description			NBIOT_Neul_NBxx_CheckReadCDPServer			: 查询CDP服务器
 @Input				pClient								: NBIOT客户端实例
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadCDPServer(NBIOT_ClientsTypeDef* pClient)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	
#if NBIOT_COMMAND_TIMEOUT_TYPE
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, NBIOT_COMMAND_NCDP_MSEC);
#else
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
#endif
	
	memset((void *)&pClient->Parameter.cdpserver, 0x0, sizeof(pClient->Parameter.cdpserver));
	
	NBIOT_Neul_NBxx_ATCmd_SetCmdStack(pClient, (unsigned char*)"AT+NCDP?\r", strlen("AT+NCDP?\r"), "OK", "ERROR");
	
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
		if (sscanf((const char*)pClient->ATCmdStack->ATRecvbuf, "%*[^NCDP]%*[^:]:%[^,],%hu", (char *)&pClient->Parameter.cdpserver.CDPServerHost, &pClient->Parameter.cdpserver.CDPServerPort) <= 0) {
			NBStatus = NBIOT_ERROR;
		}
	}
#if NBIOT_PRINT_ERROR_CODE_TYPE
	else {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#endif
	
	return NBStatus;
}
#endif

#if NBIOT_ATCMD_SET_DNSSERVERADDRESS
/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetDNSServerAddress(NBIOT_ClientsTypeDef* pClient, const char *pri_dns, const char *sec_dns)
 @Description			NBIOT_Neul_NBxx_SetDNSServerAddress		: 设置DNS服务器地址
 @Input				pClient								: NBIOT客户端实例
					pri_dns								: Primary   DNS Server Address
					sec_dns								: Secondary DNS Server Address
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SetDNSServerAddress(NBIOT_ClientsTypeDef* pClient, const char *pri_dns, const char *sec_dns)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	u16 datalength = 0;
	
#if NBIOT_COMMAND_TIMEOUT_TYPE
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, NBIOT_COMMAND_QIDNSCFG_MSEC);
#else
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
#endif
	
	memset((void *)pClient->DataProcessStack, 0x0, pClient->DataProcessStack_size);
	sprintf((char *)pClient->DataProcessStack, "AT+QIDNSCFG=%s", pri_dns);
	
	datalength = strlen((const char*)pClient->DataProcessStack);
	if (sec_dns != NULL) {
		sprintf((char *)(pClient->DataProcessStack + datalength), ",%s", sec_dns);
		datalength = strlen((const char*)pClient->DataProcessStack);
	}
	
	sprintf((char *)(pClient->DataProcessStack + datalength), "%c", '\r');
	
	NBIOT_Neul_NBxx_ATCmd_SetCmdStack(pClient, pClient->DataProcessStack, strlen((char *)pClient->DataProcessStack), "OK", "ERROR");
	
