gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/Libraries/NBIot/nbiotfunc.c
	NBIOT_Neul_NBxx_ATCmd_SetCmdStack(pClient, (unsigned char*)"AT+NMGR\r", strlen("AT+NMGR\r"), "OK", "ERROR");
	
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
		if (sscanf((const char*)pClient->ATCmdStack->ATRecvbuf, "\r\n%hd,%s\r", &pClient->Recvlen, pClient->DataProcessStack) <= 0) {
			NBStatus = NBIOT_ERROR;
			goto exit;
		}
		if (sscanf((const char*)pClient->DataProcessStack, "%02X%04X%04X%04X%04X", &CMDType, &DatasetID, &TaskID, &StreamLen, &PayloadLen) <= 0) {
			NBStatus = NBIOT_ERROR;
			goto exit;
		}
		pHead->CMDType		= CMDType;
		pHead->DatasetID	= DatasetID;
		pHead->TaskID		= TaskID;
		pHead->StreamLen	= StreamLen;
		pHead->PayloadLen	= PayloadLen;
		memset((void *)pClient->Recvbuf, 0x0, pClient->Recvbuf_size);
		for (int i = sizeof(NBIOT_ByteStreamDnloadHead); i < pClient->Recvlen; i++) {
			sscanf((const char*)(pClient->DataProcessStack + i * 2), "%02X", &utmp);
			pClient->Recvbuf[i] = utmp;
		}
		pClient->Recvlen -= sizeof(NBIOT_ByteStreamDnloadHead);
	}
#if NBIOT_PRINT_ERROR_CODE_TYPE
	else {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#endif
	
exit:
	return NBStatus;
}
#endif

#if NBIOT_ATCMD_GET_CONDATA
/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadCONDataStatus(NBIOT_ClientsTypeDef* pClient)
 @Description			NBIOT_Neul_NBxx_CheckReadCONDataStatus			: 查询终端CON数据发送状态
 @Input				pClient									: NBIOT客户端实例
 @Return				NBIOT_StatusTypeDef							: NBIOT处理状态
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_CheckReadCONDataStatus(NBIOT_ClientsTypeDef* pClient)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	int dataStatusval = 0;
#if (NBIOT_AUTO_MODEL_TYPE == NBIOT_AUTO_MODEL_ENABLE)
	unsigned char* WulDataStatusCmdLierda = (unsigned char*)"AT+MLWULDATASTATUS?\r";
	unsigned char* WulDataStatusCmdQuectel = (unsigned char*)"AT+QLWULDATASTATUS?\r";
	unsigned char* WulDataStatusCmd = WulDataStatusCmdLierda;
#endif
	
#if NBIOT_COMMAND_TIMEOUT_TYPE
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, NBIOT_COMMAND_DATASTATUS_MSEC);
#else
	NBIOT_Neul_NBxx_DictateEvent_SetTime(pClient, pClient->Command_Timeout_Msec);
#endif
	
#if (NBIOT_AUTO_MODEL_TYPE == NBIOT_AUTO_MODEL_ENABLE)
	if (strcmp(pClient->Parameter.manufacturer, NBIOT_MANUFACTURER_LIERDA) == 0) {
		WulDataStatusCmd = WulDataStatusCmdLierda;
	}
	else if (strcmp(pClient->Parameter.manufacturer, NBIOT_MANUFACTURER_QUECTEL) == 0) {
		WulDataStatusCmd = WulDataStatusCmdQuectel;
	}
	else {
		WulDataStatusCmd = WulDataStatusCmdLierda;
	}
	
	NBIOT_Neul_NBxx_ATCmd_SetCmdStack(pClient, WulDataStatusCmd, strlen((const char*)WulDataStatusCmd), "OK", "ERROR");
#elif (NBIOT_AUTO_MODEL_TYPE == NBIOT_AUTO_MODEL_DISABLE)
#ifndef NBIOT_MODEL_TYPE
	#error No Define NBIOT MODEL!
#else
	#if (NBIOT_MODEL_TYPE == NBIOT_MODEL_LIERDA)
		NBIOT_Neul_NBxx_ATCmd_SetCmdStack(pClient, (unsigned char*)"AT+MLWULDATASTATUS?\r", strlen("AT+MLWULDATASTATUS?\r"), "OK", "ERROR");
	#elif (NBIOT_MODEL_TYPE == NBIOT_MODEL_QUECTEL)
		NBIOT_Neul_NBxx_ATCmd_SetCmdStack(pClient, (unsigned char*)"AT+QLWULDATASTATUS?\r", strlen("AT+QLWULDATASTATUS?\r"), "OK", "ERROR");
	#else
		#error NBIOT MODEL Define Error
	#endif
#endif
#else
	#error NBIOT AUTO MODEL Define Error
#endif
	
	if ((NBStatus = pClient->ATCmdStack->Write(pClient->ATCmdStack)) == NBIOT_OK) {
#if (NBIOT_AUTO_MODEL_TYPE == NBIOT_AUTO_MODEL_ENABLE)
		if (sscanf((const char*)pClient->ATCmdStack->ATRecvbuf, "%*[^WULDATASTATUS]%*[^:]:%d", &dataStatusval) <= 0) {
#elif (NBIOT_AUTO_MODEL_TYPE == NBIOT_AUTO_MODEL_DISABLE)
#ifndef NBIOT_MODEL_TYPE
	#error No Define NBIOT MODEL!
#else
	#if (NBIOT_MODEL_TYPE == NBIOT_MODEL_LIERDA)
		if (sscanf((const char*)pClient->ATCmdStack->ATRecvbuf, "%*[^+MLWULDATASTATUS]%*[^:]:%d", &dataStatusval) <= 0) {
	#elif (NBIOT_MODEL_TYPE == NBIOT_MODEL_QUECTEL)
		if (sscanf((const char*)pClient->ATCmdStack->ATRecvbuf, "%*[^+QLWULDATASTATUS]%*[^:]:%d", &dataStatusval) <= 0) {
	#else
		#error NBIOT MODEL Define Error
	#endif
#endif
#else
	#error NBIOT AUTO MODEL Define Error
#endif
			NBStatus = NBIOT_ERROR;
		}
		else {
			if ( (dataStatusval == Unsent) || \
				(dataStatusval == WaitResponse) || \
				(dataStatusval == SendFail) || \
				(dataStatusval == SendTimeout) || \
				(dataStatusval == SendSussess) || \
				(dataStatusval == RecvRST) ) {
				pClient->Parameter.condatastate = (NBIOT_CONDataStatusTypeDef)dataStatusval;
			}
			else {
				NBStatus = NBIOT_ERROR;
			}
		}
	}
#if NBIOT_PRINT_ERROR_CODE_TYPE
	else {
		NBStatus = NBIOT_Neul_NBxx_DictateEvent_GetError(pClient);
	}
#endif
	
	return NBStatus;
}
#endif

#if NBIOT_ATCMD_SET_CONDATA
/**********************************************************************************************************
 @Function			NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SendCOAPPayloadFlag(NBIOT_ClientsTypeDef* pClient, const char *flag)
 @Description			NBIOT_Neul_NBxx_SendCOAPPayloadFlag		: COAP发送一条负载数据(FLAG)
 @Input				pClient								: NBIOT客户端实例
					flag							0x0000	: NON 一般
												0x0001	: NON 立马 IDLE
												0x0100	: CON 一般
												0x0101	: CON 立马 IDLE
 @Return				NBIOT_StatusTypeDef						: NBIOT处理状态
 @attention			必须注网成功才可发送负载数据
					最大有效数据长度为512字节
					每次只能缓存一条消息
**********************************************************************************************************/
NBIOT_StatusTypeDef NBIOT_Neul_NBxx_SendCOAPPayloadFlag(NBIOT_ClientsTypeDef* pClient, const char *flag)
{
	NBIOT_StatusTypeDef NBStatus = NBIOT_OK;
	u16 length = 0;
#if (NBIOT_AUTO_MODEL_TYPE == NBIOT_AUTO_MODEL_ENABLE)
	unsigned char* WulDataExCmdLierda = (unsigned char*)"AT+MLWULDATAEX=%d,";
	unsigned char* WulDataExCmdQuectel = (unsigned char*)"AT+QLWULDATAEX=%d,";
	unsigned char* WulDataExCmd = WulDataExCmdLierda;
#endif
	
	if ((pClient->Sendlen > pClient->Sendbuf_size) || (((2 * pClient->Sendlen) + 29) > pClient->DataProcessStack_size) || (((2 * pClient->Sendlen) + 29) > pClient->ATCmdStack->ATSendbuf_size)) {
		NBStatus = NBIOT_ERROR;
		goto exit;
	}
	
